AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/UAV/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

deltaT          1;

endTime         2000;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

runTimeModifiable true;

libs
(
    // Needed for availability of porous baffle boundary in potentialFoam
    #include "turbulenceLib"
);

functions
{
    ReportingFunction
    {
        type                forces;
        libs                ("libforces.so");
        log                 true;

        patches             ( wall );
        p                   p;
        U                   U;
        rho                 rhoInf;
        rhoInf              1.2;
        pRef                0.0;
        porosity            false;
        writeFields         false;
        CofR                ( 0.0 0.0 0.0 );

        binData
        {
            nBin            0;
            direction       ( 0.0 0.0 1.0 );
            cumulative      true;
        }
    }

}

// ************************************************************************* //
